04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleVoF/testTubeMixer/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type            solidBody;

    libs            ("libpointMeshMovers.so");

    cellZone        all;

    solidBodyMotionFunction
    {
        type            multiMotion;

        // Table rotating in z axis
        rotatingTable
        {
            type            rotatingMotion;

            origin          (0 0.1 0);
            axis            (0 0 1);
            omega           60 [rpm];
        }

        // Tube rocking on rotating table
        rotatingBox
        {
            type            oscillatingRotatingMotion;

            origin          (0 0 0);
            amplitude       (45 0 0);   // 45 degrees max tilt
            omega           40;         // rad/s
        }
    }
}


// ************************************************************************* //
